## dev: lambda-api
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 6 to add, 8 to change, 6 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                                NAME                                 |
|----------|---------------------------------------------------------------------|
| recreate | `aws_api_gateway_base_path_mapping.api_lambda_alt`                  |
|          | `aws_api_gateway_deployment.api`                                    |
|          | `aws_api_gateway_domain_name.alt_api_lambda`                        |
|          | `aws_lambda_provisioned_concurrency_config.api`                     |
|          | `aws_route53_record.api-notification-alt-A[0]`                      |
|          | `aws_secretsmanager_secret_version.new-relic-license-key`           |
| update   | `aws_api_gateway_stage.api`                                         |
|          | `aws_cloudwatch_log_group.api_gateway_log_group`                    |
|          | `aws_iam_policy.api`                                                |
|          | `aws_iam_policy.ecr`                                                |
|          | `aws_kinesis_firehose_delivery_stream.firehose-api-lambda-waf-logs` |
|          | `aws_lambda_alias.api_latest`                                       |
|          | `aws_lambda_function.api`                                           |
|          | `aws_wafv2_web_acl.api_lambda`                                      |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
+/- create replacement and then destroy
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.api_policies will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "api_policies" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:logs:ca-central-1:800095993820:log-group:api_gateway_log_group",
            ]
        }
      + statement {
          + actions   = [
              + "ecr:BatchGetImage",
              + "ecr:GetDownloadUrlForlayer",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:ecr:ca-central-1:800095993820:repository/notify/api-lambda",
            ]
        }
      + statement {
          + actions   = [
              + "s3:*",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:s3:::notification-canada-ca-dev-csv-upload/*",
            ]
        }
      + statement {
          + actions   = [
              + "securityhub:BatchImportFindings",
              + "sns:Publish",
              + "sqs:*",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "ssm:DescribeParameters",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "ssm:GetParameters",
            ]
          + effect    = "Allow"
          + resources = (sensitive value)
        }
      + statement {
          + actions   = [
              + "secretsmanager:GetSecretValue",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "cloudwatch:GetMetricData",
              + "cloudwatch:GetMetricStatistics",
              + "cloudwatch:ListMetrics",
              + "config:BatchGetResourceConfig",
              + "config:ListDiscoveredResources",
              + "lambda:GetAccountSettings",
              + "lambda:ListAliases",
              + "lambda:ListEventSourceMappings",
              + "lambda:ListFunctions",
              + "lambda:ListTags",
              + "tag:GetResources",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "xray:PutTelemetryRecords",
              + "xray:PutTraceSegments",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
        }
    }

  # data.aws_iam_policy_document.ecr will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "ecr" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "ecr:GetAuthorizationToken",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
          + sid       = "GetAuthorizationToken"
        }
      + statement {
          + actions   = [
              + "ecr:BatchCheckLayerAvailability",
              + "ecr:BatchGetImage",
              + "ecr:CompleteLayerUpload",
              + "ecr:GetDownloadUrlForLayer",
              + "ecr:InitiateLayerUpload",
              + "ecr:PutImage",
              + "ecr:UploadLayerPart",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:ecr:ca-central-1:800095993820:repository/notify/api-lambda",
            ]
          + sid       = "AllowPushPull"
        }
      + statement {
          + actions   = [
              + "lambda:GetAlias",
              + "lambda:GetFunction",
              + "lambda:GetFunctionConfiguration",
              + "lambda:ListAliases",
              + "lambda:ListVersionsByFunction",
              + "lambda:PublishVersion",
              + "lambda:UpdateAlias",
              + "lambda:UpdateFunctionCode",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:lambda:ca-central-1:800095993820:function:api-lambda",
            ]
          + sid       = "PermissionsToUpdateFunction"
        }
      + statement {
          + actions   = [
              + "lambda:GetLayerVersion",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:lambda:ca-central-1:451483290750:layer:NewRelicPython*:*",
            ]
          + sid       = "PermissionsToDownloadNewRelicLambdaLayers"
        }
    }

  # aws_api_gateway_base_path_mapping.api_lambda_alt must be replaced
-/+ resource "aws_api_gateway_base_path_mapping" "api_lambda_alt" {
      ~ domain_name = "api.alpha.dev.notification.cdssandbox.xyz" -> "api.dev.alpha.notification.cdssandbox.xyz" # forces replacement
      ~ id          = "api.alpha.dev.notification.cdssandbox.xyz/" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # aws_api_gateway_deployment.api must be replaced
+/- resource "aws_api_gateway_deployment" "api" {
      ~ created_date  = "2024-08-29T14:45:46Z" -> (known after apply)
      ~ execution_arn = "arn:aws:execute-api:ca-central-1:800095993820:yqkswtwqz0/" -> (known after apply)
      ~ id            = "tasytw" -> (known after apply)
      ~ invoke_url    = "https://yqkswtwqz0.execute-api.ca-central-1.amazonaws.com/" -> (known after apply)
      ~ triggers      = { # forces replacement
          ~ "redeployment" = "304451798044b5fdc34090ab32a96a2473bf6afa" -> "c1c3df7a50ee1a689772094fb67e86de0dd192aa"
        }
        # (2 unchanged attributes hidden)
    }

  # aws_api_gateway_domain_name.alt_api_lambda must be replaced
-/+ resource "aws_api_gateway_domain_name" "alt_api_lambda" {
      ~ arn                                    = "arn:aws:apigateway:ca-central-1::/domainnames/api.alpha.dev.notification.cdssandbox.xyz" -> (known after apply)
      ~ certificate_upload_date                = "2024-08-29T14:43:38Z" -> (known after apply)
      + cloudfront_domain_name                 = (known after apply)
      ~ cloudfront_zone_id                     = "Z2FDTNDATAQYW2" -> (known after apply)
      ~ domain_name                            = "api.alpha.dev.notification.cdssandbox.xyz" -> "api.dev.alpha.notification.cdssandbox.xyz" # forces replacement
      ~ id                                     = "api.alpha.dev.notification.cdssandbox.xyz" -> (known after apply)
      + ownership_verification_certificate_arn = (known after apply)
      ~ regional_domain_name                   = "d-dro1gij5gl.execute-api.ca-central-1.amazonaws.com" -> (known after apply)
      ~ regional_zone_id                       = "Z19DQILCV0OWEC" -> (known after apply)
      - tags                                   = {} -> null
      ~ tags_all                               = {} -> (known after apply)
        # (5 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_api_gateway_stage.api will be updated in-place
  ~ resource "aws_api_gateway_stage" "api" {
      ~ deployment_id         = "tasytw" -> (known after apply)
        id                    = "ags-yqkswtwqz0-v1"
        tags                  = {}
        # (14 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_cloudwatch_log_group.api_gateway_log_group will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "api_gateway_log_group" {
        id                = "api_gateway_log_group"
        name              = "api_gateway_log_group"
      ~ retention_in_days = 14 -> 365
        tags              = {
            "Application" = "lambda"
            "CostCenter"  = "notification-canada-ca-dev"
            "Environment" = "dev"
        }
        # (6 unchanged attributes hidden)
    }

  # aws_iam_policy.api will be updated in-place
  ~ resource "aws_iam_policy" "api" {
        id               = "arn:aws:iam::800095993820:policy/notify-api"
        name             = "notify-api"
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:CreateLogStream",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:logs:ca-central-1:800095993820:log-group:api_gateway_log_group"
                    },
                  - {
                      - Action   = [
                          - "ecr:GetDownloadUrlForlayer",
                          - "ecr:BatchGetImage",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:ecr:ca-central-1:800095993820:repository/notify/api-lambda"
                    },
                  - {
                      - Action   = "s3:*"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::notification-canada-ca-dev-csv-upload/*"
                    },
                  - {
                      - Action   = [
                          - "sqs:*",
                          - "sns:Publish",
                          - "securityhub:BatchImportFindings",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = "ssm:DescribeParameters"
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = "ssm:GetParameters"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:ssm:ca-central-1:800095993820:parameter/ENVIRONMENT_VARIABLES"
                    },
                  - {
                      - Action   = "secretsmanager:GetSecretValue"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:secretsmanager:ca-central-1:800095993820:secret:NEW_RELIC_LICENSE_KEY-nytDkj"
                    },
                  - {
                      - Action   = [
                          - "tag:GetResources",
                          - "lambda:ListTags",
                          - "lambda:ListFunctions",
                          - "lambda:ListEventSourceMappings",
                          - "lambda:ListAliases",
                          - "lambda:GetAccountSettings",
                          - "config:ListDiscoveredResources",
                          - "config:BatchGetResourceConfig",
                          - "cloudwatch:ListMetrics",
                          - "cloudwatch:GetMetricStatistics",
                          - "cloudwatch:GetMetricData",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = [
                          - "xray:PutTraceSegments",
                          - "xray:PutTelemetryRecords",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {}
        # (7 unchanged attributes hidden)
    }

  # aws_iam_policy.ecr will be updated in-place
  ~ resource "aws_iam_policy" "ecr" {
        id               = "arn:aws:iam::800095993820:policy/ecr-api-lambda-access"
        name             = "ecr-api-lambda-access"
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "ecr:GetAuthorizationToken"
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = "GetAuthorizationToken"
                    },
                  - {
                      - Action   = [
                          - "ecr:UploadLayerPart",
                          - "ecr:PutImage",
                          - "ecr:InitiateLayerUpload",
                          - "ecr:GetDownloadUrlForLayer",
                          - "ecr:CompleteLayerUpload",
                          - "ecr:BatchGetImage",
                          - "ecr:BatchCheckLayerAvailability",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:ecr:ca-central-1:800095993820:repository/notify/api-lambda"
                      - Sid      = "AllowPushPull"
                    },
                  - {
                      - Action   = [
                          - "lambda:UpdateFunctionCode",
                          - "lambda:UpdateAlias",
                          - "lambda:PublishVersion",
                          - "lambda:ListVersionsByFunction",
                          - "lambda:ListAliases",
                          - "lambda:GetFunctionConfiguration",
                          - "lambda:GetFunction",
                          - "lambda:GetAlias",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:lambda:ca-central-1:800095993820:function:api-lambda"
                      - Sid      = "PermissionsToUpdateFunction"
                    },
                  - {
                      - Action   = "lambda:GetLayerVersion"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:lambda:ca-central-1:451483290750:layer:NewRelicPython*:*"
                      - Sid      = "PermissionsToDownloadNewRelicLambdaLayers"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {}
        # (7 unchanged attributes hidden)
    }

  # aws_kinesis_firehose_delivery_stream.firehose-api-lambda-waf-logs will be updated in-place
  ~ resource "aws_kinesis_firehose_delivery_stream" "firehose-api-lambda-waf-logs" {
        id             = "arn:aws:firehose:ca-central-1:800095993820:deliverystream/aws-waf-logs-notification-canada-ca-api-lambda-waf"
        name           = "aws-waf-logs-notification-canada-ca-api-lambda-waf"
        tags           = {
            "CostCenter" = "notification-canada-ca-dev"
            "Terraform"  = "true"
        }
        # (5 unchanged attributes hidden)

      ~ extended_s3_configuration {
          + custom_time_zone    = "UTC"
          # Warning: this attribute value will be marked as sensitive and will not
          # display in UI output after applying this change. The value is unchanged.
          ~ prefix              = (sensitive value)
            # (9 unchanged attributes hidden)

            # (2 unchanged blocks hidden)
        }

        # (1 unchanged block hidden)
    }

  # aws_lambda_alias.api_latest will be updated in-place
  ~ resource "aws_lambda_alias" "api_latest" {
      ~ function_version = "41" -> (known after apply)
        id               = "arn:aws:lambda:ca-central-1:800095993820:function:api-lambda:latest"
        name             = "latest"
        # (4 unchanged attributes hidden)
    }

  # aws_lambda_function.api will be updated in-place
  ~ resource "aws_lambda_function" "api" {
        id                             = "api-lambda"
      ~ qualified_arn                  = "arn:aws:lambda:ca-central-1:800095993820:function:api-lambda:41" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:ca-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ca-central-1:800095993820:function:api-lambda:41/invocations" -> (known after apply)
        tags                           = {}
      ~ version                        = "41" -> (known after apply)
        # (25 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "AWS_XRAY_SDK_ENABLED"                  = "false" -> "true"
              # Warning: this attribute value will be marked as sensitive and will not
              # display in UI output after applying this change. The value is unchanged.
              ~ "NEW_RELIC_ACCOUNT_ID"                  = (sensitive value)
                # (17 unchanged elements hidden)
            }
        }

        # (4 unchanged blocks hidden)
    }

  # aws_lambda_provisioned_concurrency_config.api is tainted, so must be replaced
-/+ resource "aws_lambda_provisioned_concurrency_config" "api" {
      ~ id                                = "api-lambda,latest" -> (known after apply)
      ~ provisioned_concurrent_executions = 0 -> 1
        # (3 unchanged attributes hidden)
    }

  # aws_route53_record.api-notification-alt-A[0] must be replaced
-/+ resource "aws_route53_record" "api-notification-alt-A" {
      + allow_overwrite                  = (known after apply)
      ~ fqdn                             = "api.alpha.dev.notification.cdssandbox.xyz" -> (known after apply)
      ~ id                               = "Z04028033PLSHVOO9ZJ1Z_api.alpha.dev.notification.cdssandbox.xyz_A" -> (known after apply)
      - multivalue_answer_routing_policy = false -> null
      ~ name                             = "api.alpha.dev.notification.cdssandbox.xyz" -> "api.dev.alpha.notification.cdssandbox.xyz" # forces replacement
      - records                          = [] -> null
      - ttl                              = 0 -> null
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_secretsmanager_secret_version.new-relic-license-key must be replaced
-/+ resource "aws_secretsmanager_secret_version" "new-relic-license-key" {
      ~ arn            = "arn:aws:secretsmanager:ca-central-1:800095993820:secret:NEW_RELIC_LICENSE_KEY-nytDkj" -> (known after apply)
      ~ id             = "arn:aws:secretsmanager:ca-central-1:800095993820:secret:NEW_RELIC_LICENSE_KEY-nytDkj|terraform-20240829144336288300000002" -> (known after apply)
      ~ secret_string  = (sensitive value) # forces replacement
      ~ version_id     = "terraform-20240829144336288300000002" -> (known after apply)
      ~ version_stages = [
          - "AWSCURRENT",
        ] -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # aws_wafv2_web_acl.api_lambda will be updated in-place
  ~ resource "aws_wafv2_web_acl" "api_lambda" {
        id                          = "53375171-298c-4a8c-88c1-18e19a44a842"
        name                        = "api-lambda-waf"
        tags                        = {
            "CostCenter" = "notification-canada-ca-dev"
        }
        # (9 unchanged attributes hidden)

      - rule {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      - rule {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      - rule {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      - rule {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      - rule {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      - rule {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + rule {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + rule {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + rule {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + rule {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + rule {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + rule {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }

        # (6 unchanged blocks hidden)
    }

Plan: 6 to add, 8 to change, 6 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_api_gateway_domain_name.alt_api_lambda"]
WARN - plan.json - main - Missing Common Tags: ["aws_api_gateway_domain_name.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_api_gateway_domain_name.api_lambda"]
WARN - plan.json - main - Missing Common Tags: ["aws_api_gateway_rest_api.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_api_gateway_stage.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_appautoscaling_target.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.api_gateway_log_group"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.ecr"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_user.ecr-user"]
WARN - plan.json - main - Missing Common Tags: ["aws_kinesis_firehose_delivery_stream.firehose-api-lambda-waf-logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_lambda_function.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.new-relic-license-key"]
WARN - plan.json - main - Missing Common Tags: ["aws_wafv2_web_acl.api_lambda"]

34 tests, 19 passed, 15 warnings, 0 failures, 0 exceptions

```

</details>
